{
  "columns": [
    {
      "id": 1,
      "name": "To Do",
      "tasks": {
        "major": [
          {
            "id": 1,
            "text": "Add import and export tabs in home for importing and exporting in sql format (Check if the same can be done for NoSQL, will likely use json format there)"
          },
          {
            "id": 2,
            "text": "Add import and export tabs in home for importing and exporting in sql format (Check if the same can be done for NoSQL, will likely use json format there)"
          },
          {
            "id": 3,
            "text": "(Something to be done near the end of development to optimize) Is the system lightweight? If not, see where corners can be cut, how to optimize, enhance speed and reduce size."
          }
        ],
        "minor": [
          {
            "id": 4,
            "text": "Allow modification of database name, let them be in their actual capitalization instead of appearing as fully lowercase (Unless it has to be displayed that way)"
          }
        ]
      }
    },
    {
      "id": 2,
      "name": "In Progress",
      "tasks": {
        "major": [
          {
            "id": 5,
            "text": "Ability to view or create and open a database in a specific database type with a command on the cmd."
          },
          {
            "id": 6,
            "text": "Check how to access the databases created in code. (Need connection link? Provide it)"
          }
        ],
        "minor": [
          {
            "id": 7,
            "text": "1.\tFix the issue of database getting deleted when it's created and user immediately goes back to list of databases without creating a collection in MongoDB."
          },
          {
            "id": 8,
            "text": "2.\tFix the handler name shown on the sidebar that shows no handler everywhere except on the home page."
          }
        ]
      }
    },
    {
      "id": 3,
      "name": "Done",
      "tasks": {
        "major": [
          {
            "id": 9,
            "text": "Created UI and styling similar to phpMyAdmin, the gui format inspiration for this project."
          },
          {
            "id": 10,
            "text": "Added SQL and NoSQL databases differentiation and context switching between them."
          },
          {
            "id": 11,
            "text": "Separated logic for SQL and NoSQL into sql_handler and nosql_handler, app.py for main work and differentiating to the two handlers."
          },
          {
            "id": 12,
            "text": "Added logic in both handlers to use db_handler and give work to the required handler to handle database-specific requests."
          }
        ],
        "minor": []
      }
    }
  ],
  "nextColumnId": 4,
  "nextTaskId": 13,
  "dropdownStates": {
    "3-major": false
  }
}