{
  "columns": [
    {
      "id": 1,
      "name": "To Do",
      "tasks": {
        "major": [
          {
            "id": 2,
            "text": "Add import and export tabs in home for importing and exporting in sql format (Check if the same can be done for NoSQL, will likely use json format there)"
          },
          {
            "id": 1,
            "text": "Ability to convert databases from one form to another easily, including from SQL to NoSQL but not from NoSQL to SQL. (Use conversion to json and dynamic figuring out of data types)"
          },
          {
            "id": 65,
            "text": "Add Firebase Firestore support to NoSQL dbs"
          },
          {
            "id": 64,
            "text": "Add support for Object Oriented Relational Databases"
          },
          {
            "id": 32,
            "text": "Add an undo and redo button that can undo or redo whatever action we had done on dbs or tables (Undo or redo crud operations, renaming, changing structure,etc)"
          },
          {
            "id": 68,
            "text": "Check for anomalies that can cause system hangups"
          },
          {
            "id": 26,
            "text": "(Something to be done near the end of development to optimize) Ensure that the system will work on all or at least most platforms"
          },
          {
            "id": 3,
            "text": "(Something to be done near the end of development to optimize) Is the system lightweight? If not, see where corners can be cut, how to optimize, enhance speed and reduce size."
          }
        ],
        "minor": [
          {
            "id": 52,
            "text": "Add function to handler to check whether user needs to be signed in or not for showing the sign out button"
          }
        ]
      }
    },
    {
      "id": 2,
      "name": "In Progress",
      "tasks": {
        "major": [
          {
            "id": 46,
            "text": "Add autocomplete sql/nosql queries"
          },
          {
            "id": 38,
            "text": "Add aggregation ability (Check out how that is done, make a tab for this)"
          }
        ],
        "minor": [
          {
            "id": 4,
            "text": "Allow modification of database name"
          }
        ]
      }
    },
    {
      "id": 3,
      "name": "Done",
      "tasks": {
        "major": [
          {
            "id": 9,
            "text": "Created UI and styling similar to phpMyAdmin, the gui format inspiration for this project."
          },
          {
            "id": 10,
            "text": "Added SQL and NoSQL databases differentiation and context switching between them."
          },
          {
            "id": 11,
            "text": "Separated logic for SQL and NoSQL into sql_handler and nosql_handler, app.py for main work and differentiating to the two handlers."
          },
          {
            "id": 12,
            "text": "Added logic in both handlers to use db_handler and give work to the required handler to handle database-specific requests."
          },
          {
            "id": 13,
            "text": "Added logic to have the programmer use gui to perform CRUD operations on SQL and NoSQL databases and also run queries (Both within tables and outside tables, but not yet outside databases in the sense can't create new databases, can only work within a database i.e work only within SQLLite's database DB1 at a time)."
          },
          {
            "id": 14,
            "text": "Added logic to allow alteration of table structure, records and documents via GUI (Shows number of records, collections, tables and documents and they update whenever insertion/creation/deletion are performed)."
          },
          {
            "id": 15,
            "text": "Added db_registry for automatically detecting handlers for plug and play experience (Programmers just need to add a file with *_handler.py and it would automatically be detected and taken as new database type, is the programmer's responsibility to follow guidelines such as stating what type of database it is and it's name and add in all the abstract methods needed)"
          },
          {
            "id": 16,
            "text": "Added two SQL databases (SQLLite and DuckDB) and tested for clashes and context switched, fixed issues and clashes."
          },
          {
            "id": 17,
            "text": "Added two NoSQL databases (MongoDB andd TinyDB) and tested if context switching is correctly executed and there are no clashes."
          },
          {
            "id": 18,
            "text": "Fix Query tab on sidebar to work in individual databases and allow creation of databases as well."
          },
          {
            "id": 5,
            "text": "Ability to view or create and open a database in a specific database type with a command on the cmd."
          },
          {
            "id": 35,
            "text": "Added PostgreSQL and MySQL databases to supported SQL databases."
          },
          {
            "id": 37,
            "text": "Fixed a bug in regards to MySQL where credentials kept failing (Strongly suspect issue with personal xammp, therefore installed MySQL separately and testing on it, all issues seem to be resolved))"
          },
          {
            "id": 42,
            "text": "Added tabs for plsql on PostgreSQL that supports it"
          },
          {
            "id": 43,
            "text": "Added triggers tab on PostgreSQL, MySQL and SQLite which supports it"
          },
          {
            "id": 47,
            "text": "Add charts like pie chart or bar graph to view the data in a table/collection"
          },
          {
            "id": 50,
            "text": "Added procedure tab and support for procedure in mysql"
          },
          {
            "id": 49,
            "text": "Add user rights"
          },
          {
            "id": 55,
            "text": "Converted the entire HTML frontend to React"
          },
          {
            "id": 45,
            "text": "Added test cases for regression testing of plsql and triggers"
          },
          {
            "id": 58,
            "text": "Added test cases for regression testing of procedures, pagination and user management"
          },
          {
            "id": 63,
            "text": "Change the NoSQL query logic in all query tabs to be less strict and allow execution of anything as long as the handler is able to."
          },
          {
            "id": 19,
            "text": "Performed rigorous regression testing at all steps, at the end of every requirement completion."
          }
        ],
        "minor": [
          {
            "id": 20,
            "text": "Fixed issue of sql databases creating databases in the same folder (Causing unrelated dbs to show up in SQLite list of dbs)"
          },
          {
            "id": 21,
            "text": "Fix the issue of 0 documents showing in collection_list"
          },
          {
            "id": 23,
            "text": "Check if NoSQL databases have issues of saving in the same folder like sql databases had issues with."
          },
          {
            "id": 22,
            "text": "Fix the issue of modify and delete button on documents not working in MongoDB."
          },
          {
            "id": 53,
            "text": "Change the NoSQL query logic in all query tabs to be less strict and allow execution of anything as long as the handler is able to."
          },
          {
            "id": 7,
            "text": "Fix the issue of database getting deleted when it's created and user immediately goes back to list of databases without creating a collection in MongoDB."
          },
          {
            "id": 8,
            "text": "Fix the handler name shown on the sidebar that shows no handler everywhere except on the home page."
          },
          {
            "id": 30,
            "text": "Fix the issue of columns containing data refusing to be renamed because they need to be dropped first"
          },
          {
            "id": 33,
            "text": "Made all SQL dbs show their db names and table names in their true capitalization (Except Duckdb which apparently has Windows's influence on it that causes dbs to be stored in lowercase but can be accessed with the capitalized form as well since it's case-insensitive and MySQL which in Windows by default stores in lowercase)"
          },
          {
            "id": 27,
            "text": "Add search bar to search db names and table names"
          },
          {
            "id": 36,
            "text": "Added a credential entry page for DBs like MySQL and PostgreSQL that needs credentials to connect and uses keyring to store these credentials for further access"
          },
          {
            "id": 34,
            "text": "Add DB-specific data types to define columns page of SQL DBs. Ensure no DB-specific code is there for this in any other place apart from it's own handler"
          },
          {
            "id": 44,
            "text": "Checked and confirmed functionality of joins"
          },
          {
            "id": 6,
            "text": "Checked how to access the databases created in code. Provided connection links for each db along with instructions and test code."
          },
          {
            "id": 25,
            "text": "Used pagination to limit the number of rows read in one go, otherwise gigantic databases can cause crashes"
          },
          {
            "id": 41,
            "text": "Added filtering ability by columns"
          },
          {
            "id": 28,
            "text": "Added ability to search for specific information in records/documents in each page"
          },
          {
            "id": 29,
            "text": "Visualize database structures with autogenerated diagrams like ER Diagrams"
          },
          {
            "id": 48,
            "text": "Test for procedures, group by, order by, having clause, aggregate functions (Like AVG, SUM, etc)), joins, functions"
          },
          {
            "id": 51,
            "text": "Noted: Postgresql requires table names to be in quotes while writing queries. This is not a bug but a feature."
          },
          {
            "id": 54,
            "text": "Fixed issue of MongoDB not showing all the fields in the search bar's filter"
          },
          {
            "id": 56,
            "text": "Added option of managing relationships for er diagrams for making them more efficient and correct, and ensured that these relationships shall be recorded in the diagram statistics for the user to view"
          },
          {
            "id": 57,
            "text": "Changed the insert, update and delete sections in sql table details page to becomes buttons which when clicked opens a modal for data entry so that they take up less space in the page"
          },
          {
            "id": 59,
            "text": "Ensured regression tests' compatibility with new React related backend changes"
          },
          {
            "id": 62,
            "text": "Fix the issue of Create Collection opening the newly created collection in sql format"
          },
          {
            "id": 60,
            "text": "Fix the issue of TinyDB not allowing <= and >= in it's queries"
          },
          {
            "id": 61,
            "text": "Fix the issue of the global query page not allowing TinyDB commands"
          },
          {
            "id": 66,
            "text": "Fixed the issue of search bar in home, database details and table/collection details not searching and providing results from all pages instead of just the current page due to pagination"
          },
          {
            "id": 67,
            "text": "Fixed issues in chart generation like legends showing as too big while the actual chart showed as too small, stats section not showing, some charts using same color for all the different fields, making the chart be scrollable to fit the size, ensuring all of the chart is visible in the downloaded image and cropping labels when too big"
          },
          {
            "id": 24,
            "text": "Add storage for query history, around 10 queries or so per database which can be accessed by using the up and down arrow keys on the query tab (The main Query tab can store queries separately, unless all query tab's functionality gets combined which might be for the better since that will make it consistent)"
          },
          {
            "id": 70,
            "text": "Add Unique checkbox and option for sql databases in both TableDetails and CreateTableModal"
          }
        ]
      }
    },
    {
      "id": 5,
      "name": "Testing",
      "tasks": {
        "major": [],
        "minor": []
      }
    }
  ],
  "nextColumnId": 6,
  "nextTaskId": 71,
  "dropdownStates": {
    "1-major": false,
    "1-minor": false,
    "2-major": false,
    "2-minor": false,
    "3-major": true,
    "3-minor": false,
    "5-major": true
  }
}